CI4_mi_veterinaria/app/Controllers/VeterinarioController.php

    public function index($modo = 'ver')
    {
        $model = new VeterinarioModel();
        $data['veterinarios'] = $model->findAll();
---
SELECT *
FROM `veterinarios`